In [69]:
import numpy as np
import pandas as pd

In [70]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [71]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [72]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [73]:
pd.Series(data = arr)

0    10
1    20
2    30
dtype: int32

In [74]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [75]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [76]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [77]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [78]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [79]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [80]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [81]:
df

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
C  0.281581 -0.942884 -0.238176 -1.417469
D  1.377995 -0.126323  0.467593 -0.636226
E -1.273284  1.070974  1.332567  1.047754

In [82]:
type(df)

pandas.core.frame.DataFrame

In [83]:
type(df['W'])

pandas.core.series.Series

In [84]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  1.060781  2.064973  0.047000  0.101312  1.107781
B  0.516625 -0.087341  1.332390  0.214951  1.849015
C  0.281581 -0.942884 -0.238176 -1.417469  0.043406
D  1.377995 -0.126323  0.467593 -0.636226  1.845587
E -1.273284  1.070974  1.332567  1.047754  0.059283

In [85]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
C  0.281581 -0.942884 -0.238176 -1.417469
D  1.377995 -0.126323  0.467593 -0.636226
E -1.273284  1.070974  1.332567  1.047754

In [86]:
df

          W         X         Y         Z       new
A  1.060781  2.064973  0.047000  0.101312  1.107781
B  0.516625 -0.087341  1.332390  0.214951  1.849015
C  0.281581 -0.942884 -0.238176 -1.417469  0.043406
D  1.377995 -0.126323  0.467593 -0.636226  1.845587
E -1.273284  1.070974  1.332567  1.047754  0.059283

In [87]:
df.drop('new',axis=1,inplace=True)

In [88]:
df

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
C  0.281581 -0.942884 -0.238176 -1.417469
D  1.377995 -0.126323  0.467593 -0.636226
E -1.273284  1.070974  1.332567  1.047754

In [89]:
df.drop('C',axis=0)

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
D  1.377995 -0.126323  0.467593 -0.636226
E -1.273284  1.070974  1.332567  1.047754

In [90]:
df

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
C  0.281581 -0.942884 -0.238176 -1.417469
D  1.377995 -0.126323  0.467593 -0.636226
E -1.273284  1.070974  1.332567  1.047754

** Selecting Rows**

In [93]:
df.loc['A']

W    1.060781
X    2.064973
Y    0.047000
Z    0.101312
Name: A, dtype: float64

In [95]:
df.iloc[2]

W    0.281581
X   -0.942884
Y   -0.238176
Z   -1.417469
Name: C, dtype: float64

In [96]:
df.loc['B','Y']

1.332390469368051

In [98]:
df.loc[['A','B'],['W']]

          W
A  1.060781
B  0.516625

In [99]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False   True   True
C   True  False  False  False
D   True  False   True  False
E  False   True   True   True

In [100]:
df[df>0]

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625       NaN  1.332390  0.214951
C  0.281581       NaN       NaN       NaN
D  1.377995       NaN  0.467593       NaN
E       NaN  1.070974  1.332567  1.047754

In [101]:
df[df['W']>0]

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
C  0.281581 -0.942884 -0.238176 -1.417469
D  1.377995 -0.126323  0.467593 -0.636226

In [103]:
df

          W         X         Y         Z
A  1.060781  2.064973  0.047000  0.101312
B  0.516625 -0.087341  1.332390  0.214951
C  0.281581 -0.942884 -0.238176 -1.417469
D  1.377995 -0.126323  0.467593 -0.636226
E -1.273284  1.070974  1.332567  1.047754

In [102]:
df[df['W']>0]['Y']

A    0.047000
B    1.332390
C   -0.238176
D    0.467593
Name: Y, dtype: float64

In [104]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.047000  2.064973
B  1.332390 -0.087341
C -0.238176 -0.942884
D  0.467593 -0.126323

In [105]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X        Y         Z
B  0.516625 -0.087341  1.33239  0.214951

In [108]:
df.reset_index(inplace = True)

In [109]:
df

  index         W         X         Y         Z
0     A  1.060781  2.064973  0.047000  0.101312
1     B  0.516625 -0.087341  1.332390  0.214951
2     C  0.281581 -0.942884 -0.238176 -1.417469
3     D  1.377995 -0.126323  0.467593 -0.636226
4     E -1.273284  1.070974  1.332567  1.047754

In [112]:
df.set_index?

In [116]:
df.set_index('index',inplace=True)

In [117]:
df

              W         X         Y         Z
index
A      1.060781  2.064973  0.047000  0.101312
B      0.516625 -0.087341  1.332390  0.214951
C      0.281581 -0.942884 -0.238176 -1.417469
D      1.377995 -0.126323  0.467593 -0.636226
E     -1.273284  1.070974  1.332567  1.047754

In [118]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [119]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [121]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [122]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [123]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [124]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [125]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [126]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [127]:
df = pd.DataFrame(data)

In [131]:
by_comp = df.groupby('Company')
by_comp

In [132]:
by_comp.mean()

C:\Users\User\AppData\Local\Temp\ipykernel_6704\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [133]:
df.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243

In [134]:
df['Company'].unique()

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [135]:
df['Company'].nunique()

3

In [136]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [153]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [154]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [155]:
def times2(x):
    return x*2

In [156]:
df['col1'].apply(np.sqrt)
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [162]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [165]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [166]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [167]:
df.isnull()

       A      B
0  False  False
1  False  False
2  False  False

In [168]:
# Drop rows with NaN Values
df.dropna()

   A  B
0  4  9
1  4  9
2  4  9

In [169]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df

ImportError: html5lib not found, please install it